controllers/UploadController.php

INSERT INTO `pictures` (`url`) VALUES ('pictures/2006420114643989.jpg')
---
	public function actionUpload()
	{
		$model = new UploadForm();
		$pic = new Pictures();

        if (Yii::$app->request->isPost) {
            //$model->file = UploadedFile::getInstance($model, 'file');

            echo $_FILES;

            if ($model->validate()) {
                $model->file->saveAs('./pictures/' . $model->file->baseName . '.' . $model->file->extension);